In [23]:
import pandas as pd
import numpy as np

In [24]:
# Sample DataFrame
data = {
    'Class': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Score': [85, 90, 78, 88, 92, 95]
}
df = pd.DataFrame(data)
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [25]:
# data['A']
x = df.get('A',0)
print(x)

0

In [28]:
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [29]:
df['Class'].sum()

'MathScienceMathScienceMathScience'

In [34]:
name = 'Math'
name.lower()

'math'

In [31]:
df['Class'].apply(lambda name:name.lower())

0       math
1    science
2       math
3    science
4       math
5    science
Name: Class, dtype: object

In [33]:
df['Class'].str.upper()

0       MATH
1    SCIENCE
2       MATH
3    SCIENCE
4       MATH
5    SCIENCE
Name: Class, dtype: object

In [35]:
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [37]:
df['Class'].value_counts()['Math']

3